; domain
(define (domain search-and-rescue-q1)

  ;; We use ADL with typed objects.
  ;; ADL is appropriate here because the model uses negative preconditions,
  ;; such as (not (inspected ?loc)) and (not (victim-at ?loc)).
  ;; The domain remains classical and symbolic: no time, no numeric fluents,
  ;; and no real partial observability are represented in Q1.
  (:requirements :adl :typing)

  (:types
    robot
    room
  )

  (:predicates

    ;; The robot is currently located in a specific room.
    (robot-at ?r - robot ?loc - room)

    ;; Known topology of the building.
    ;; Connections are not automatically symmetric.
    (connected ?from - room ?to - room)

    ;; The robot has already inspected a room.
    (inspected ?loc - room)

    ;; Real victim location in the model.
    ;; Rescue cannot use this directly: detection is required first.
    (victim-at ?loc - room)

    ;; Information acquired by inspection.
    (victim-detected ?loc - room)

    ;; Final mission condition.
    (rescued)
  )

  ;; The robot can move only before the rescue is completed.
  ;; This prevents plans where the robot rescues the victim and then continues exploring.
  (:action move
    :parameters (?r - robot ?from - room ?to - room)
    :precondition (and
      (not (rescued))
      (robot-at ?r ?from)
      (connected ?from ?to)
    )
    :effect (and
      (not (robot-at ?r ?from))
      (robot-at ?r ?to)
    )
  )

  ;; The robot can inspect an empty room only before the rescue is completed.
  (:action inspect-empty-room
    :parameters (?r - robot ?loc - room)
    :precondition (and
      (not (rescued))
      (robot-at ?r ?loc)
      (not (inspected ?loc))
      (not (victim-at ?loc))
    )
    :effect (and
      (inspected ?loc)
    )
  )

  ;; The robot can inspect the victim room only before the rescue is completed.
  ;; This action produces the detection fact needed for rescue.
  (:action inspect-victim-room
    :parameters (?r - robot ?loc - room)
    :precondition (and
      (not (rescued))
      (robot-at ?r ?loc)
      (not (inspected ?loc))
      (victim-at ?loc)
    )
    :effect (and
      (inspected ?loc)
      (victim-detected ?loc)
    )
  )

  ;; Rescue is the final action.
  ;; Once rescued becomes true, move and inspect actions are no longer applicable.
  (:action rescue
    :parameters (?r - robot ?loc - room)
    :precondition (and
      (robot-at ?r ?loc)
      (victim-detected ?loc)
    )
    :effect (and
      (rescued)
    )
  )
)

; problem
(define (problem search-and-rescue-exploration)

  ;; This problem uses the Q1 classical PDDL domain.
  ;; It represents the exploration-oriented instance of the assignment.
  (:domain search-and-rescue-q1)

  ;; Objects are the concrete entities of this problem.
  ;; The robot is named rescuebot.
  ;; The building is represented as a small graph of rooms.
  (:objects
    rescuebot - robot
    entrance corridor storage lab infirmary - room
  )

  ;; The initial state lists all facts that are true at the beginning.
  ;; Facts not listed here are false by default.
  (:init

    ;; Initial robot position.
    (robot-at rescuebot entrance)

    ;; Known building topology.
    ;; Connections are explicitly listed in both directions because
    ;; connected is not automatically symmetric in PDDL.
    (connected entrance corridor)
    (connected corridor entrance)

    (connected corridor storage)
    (connected storage corridor)

    (connected corridor lab)
    (connected lab corridor)

    (connected lab infirmary)
    (connected infirmary lab)

    ;; Real victim location in the model.
    ;; This is needed because classical PDDL requires a fully specified state.
    ;; However, rescue cannot use this fact directly: the robot must inspect
    ;; the room and produce victim-detected first.
    (victim-at infirmary)
  )

  ;; The goal requires both rescue and evidence that some exploration occurred.
  ;; The inspected predicates force the plan to include explicit inspection
  ;; before reaching the final rescue condition.
  (:goal
    (and
      (inspected storage)
      (inspected lab)
      (rescued)
    )
  )
)

; plan
1. (move rescuebot entrance corridor)
   deleted: (robot-at rescuebot entrance)
   added: (robot-at rescuebot corridor)
   goals met: 0 of 3
2. (move rescuebot corridor lab)
   deleted: (robot-at rescuebot corridor)
   added: (robot-at rescuebot lab)
   goals met: 0 of 3
3. (inspect-empty-room rescuebot lab)
   added: (inspected lab)
   goals met: 1 of 3
4. (move rescuebot lab infirmary)
   deleted: (robot-at rescuebot lab)
   added: (robot-at rescuebot infirmary)
   goals met: 1 of 3
5. (inspect-victim-room rescuebot infirmary)
   added: (inspected infirmary) (victim-detected infirmary)
   goals met: 1 of 3
6. (move rescuebot infirmary lab)
   deleted: (robot-at rescuebot infirmary)
   added: (robot-at rescuebot lab)
   goals met: 1 of 3
7. (move rescuebot lab corridor)
   deleted: (robot-at rescuebot lab)
   added: (robot-at rescuebot corridor)
   goals met: 1 of 3
8. (move rescuebot corridor storage)
   deleted: (robot-at rescuebot corridor)
   added: (robot-at rescuebot storage)
   goals met: 1 of 3
9. (inspect-empty-room rescuebot storage)
   added: (inspected storage)
   goals met: 2 of 3
10. (move rescuebot storage corridor)
   deleted: (robot-at rescuebot storage)
   added: (robot-at rescuebot corridor)
   goals met: 2 of 3
11. (move rescuebot corridor lab)
   deleted: (robot-at rescuebot corridor)
   added: (robot-at rescuebot lab)
   goals met: 2 of 3
12. (move rescuebot lab infirmary)
   deleted: (robot-at rescuebot lab)
   added: (robot-at rescuebot infirmary)
   goals met: 2 of 3
13. (rescue rescuebot infirmary)
   added: (rescued)
   goals met: 3 of 3
